namespace Homework4
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.OutputEncoding = System.Text.Encoding.Unicode;
            string text = "Дано текст, який потрібно розмістити в колекцію стрічок. (Можна для збереження використовувати і масив). Текст містить речення, які необов’язково розташовані в одній стрічці. Речення можуть закінчуватися крапкою, комою, знаком оклику та знаком запитання. Вважати, що цих знаків не може бути в середині речень. У реченнях може бути текст в круглих дужках.  Потрібно знайти та видрукувати всі речення, які містять інформацію в дужках. Вкладених круглих дужок немає. Розв’язати задачу, не використовуючи злиття (конкатенацію) стрічок. Продемонструвати виконання для текстів українською та англійською мовами.";
            Task1 t1 = new Task1(text);
        }
    }
}